guangli2015/google_fast_pair_input_device_nRF5SDK_17_1_0/ble_gfp.c
//            account_key_t data5;
//data5.account_key[0]=55;
//     err_code = nrf_queue_push(&account_key_queue,&data5);
//    APP_ERROR_CHECK(err_code);

//                account_key_t data7;
//data7.account_key[0]=88;
//     err_code = nrf_queue_push(&account_key_queue,&data7);
//    APP_ERROR_CHECK(err_code);

//                    account_key_t data8;
//data8.account_key[0]=99;
//     err_code = nrf_queue_push(&account_key_queue,&data8);
//    APP_ERROR_CHECK(err_code);
    size_t count;
 count= nrf_queue_utilization_get(&account_key_queue);
NRF_LOG_INFO("\nqueue used %d ",count);
account_key_t data6[5]={99};

        err_code = nrf_queue_read(&account_key_queue,data6,count);
     NRF_LOG_INFO("data6 %d err_code %d ",data6[0].account_key[0],err_code);
     NRF_LOG_INFO("data6 %d err_code %d ",data6[1].account_key[0],err_code);
     NRF_LOG_INFO("data6 %d err_code %d ",data6[2].account_key[0],err_code);
     NRF_LOG_INFO("data6 %d err_code %d ",data6[3].account_key[0],err_code);
     NRF_LOG_INFO("data6 %d err_code %d ",data6[4].account_key[0],err_code);
      for (size_t i=0;i<count;i++)
      {
         err_code = nrf_queue_push(&account_key_queue,(data6+i));
        APP_ERROR_CHECK(err_code);
      }


     count = nrf_queue_utilization_get(&account_key_queue);
NRF_LOG_INFO("\nqueue used %d ",count);
//account_key_t data6[5]={99};

        err_code = nrf_queue_read(&account_key_queue,data6,count);
     NRF_LOG_INFO("data6 %d err_code %d ",data6[0].account_key[0],err_code);
     NRF_LOG_INFO("data6 %d err_code %d ",data6[1].account_key[0],err_code);
     NRF_LOG_INFO("data6 %d err_code %d ",data6[2].account_key[0],err_code);
     NRF_LOG_INFO("data6 %d err_code %d ",data6[3].account_key[0],err_code);
     NRF_LOG_INFO("data6 %d err_code %d ",data6[4].account_key[0],err_code);
           for (size_t i=0;i<count;i++)
      {
         err_code = nrf_queue_push(&account_key_queue,(data6+i));
        APP_ERROR_CHECK(err_code);
      }


      count= nrf_queue_utilization_get(&account_key_queue);
NRF_LOG_INFO("\nqueue used %d ",count);
//account_key_t data6[5]={99};

   //     err_code = nrf_queue_read(&account_key_queue,data6,count);
     NRF_LOG_INFO("data6 %d err_code %d ",data6[0].account_key[0],err_code);
     NRF_LOG_INFO("data6 %d err_code %d ",data6[1].account_key[0],err_code);
     NRF_LOG_INFO("data6 %d err_code %d ",data6[2].account_key[0],err_code);
     NRF_LOG_INFO("data6 %d err_code %d ",data6[3].account_key[0],err_code);
     NRF_LOG_INFO("data6 %d err_code %d ",data6[4].account_key[0],err_code);
           for (size_t i=0;i<count;i++)
      {
         err_code = nrf_queue_push(&account_key_queue,(data6+i));
        APP_ERROR_CHECK(err_code);
      }


    
}


static size_t fp_crypto_account_key_filter_size(size_t n)
{
	if (n == 0) {
		return 0;
	} else {
		return 1.2 * n + 3;
	}
}
static  void gfp_memcpy_swap(void *dst, const void *src, size_t length)
{
	uint8_t *pdst = (uint8_t *)dst;
	const uint8_t *psrc = (const uint8_t *)src;

	ASSERT(((psrc < pdst && (psrc + length) <= pdst) ||
		  (psrc > pdst && (pdst + length) <= psrc)));

	psrc += length - 1;

	for (; length > 0; length--) {
		*pdst++ = *psrc--;
	}
}
static inline void sys_put_be16(uint16_t val, uint8_t dst[2])
{
	dst[0] = val >> 8;
	dst[1] = val;
}
static inline uint16_t sys_get_be16(const uint8_t src[2])
{
	return ((uint16_t)src[0] << 8) | src[1];
}

static inline uint32_t sys_get_be32(const uint8_t src[4])
{
	return ((uint32_t)sys_get_be16(&src[0]) << 16) | sys_get_be16(&src[2]);
}

//crypto ********************************************************************
static void print_array(uint8_t const * p_string, size_t size)
{
    #if NRF_LOG_ENABLED
    size_t i;
    NRF_LOG_RAW_INFO("    ");
    for(i = 0; i < size; i++)
    {
        NRF_LOG_RAW_INFO("%02x ", p_string[i]);
    }
    #endif // NRF_LOG_ENABLED
}


static void print_hex(char const * p_msg, uint8_t const * p_data, size_t size)
{
    NRF_LOG_INFO(p_msg);
    print_array(p_data, size);
    NRF_LOG_RAW_INFO("\r\n");
}
static ret_code_t fp_crypto_ecdh_shared_secret(uint8_t *secret_key, const uint8_t *public_key,
				 const uint8_t *private_key)
{
     nrf_crypto_ecc_private_key_t              alice_private_key;
     nrf_crypto_ecc_public_key_t               bob_public_key;

    ret_code_t                                       err_code = NRF_SUCCESS;
    size_t                                           size;

    size = FP_CRYPTO_ECDH_PUBLIC_KEY_LEN;

    // Alice converts Bob's raw public key to internal representation
    err_code = nrf_crypto_ecc_public_key_from_raw(&g_nrf_crypto_ecc_secp256r1_curve_info,
                                                  &bob_public_key,
                                                  public_key, size);
    if(NRF_SUCCESS != err_code)
    {
      return err_code;
    }

    //  converts  raw private key to internal representation
    err_code = nrf_crypto_ecc_private_key_from_raw(&g_nrf_crypto_ecc_secp256r1_curve_info,
                                                   &alice_private_key,
                                                   private_key,
                                                   32);
    if(NRF_SUCCESS != err_code)
    {
      return err_code;
    }

    //  computes shared secret using ECDH
    size = FP_CRYPTO_ECDH_SHARED_KEY_LEN;
    err_code = nrf_crypto_ecdh_compute(NULL,
                                       &alice_private_key,
                                       &bob_public_key,
                                       secret_key,
                                       &size);
    if(NRF_SUCCESS != err_code)
    {
      return err_code;
    }

    // Alice can now use shared secret
    //print_hex("Alice's shared secret: ", secret_key, size);

    // Key deallocation
    err_code = nrf_crypto_ecc_private_key_free(&alice_private_key);
    
    err_code = nrf_crypto_ecc_public_key_free(&bob_public_key);
    

    return err_code;
}

#if 0
/**@brief Function for handling the @ref BLE_GAP_EVT_CONNECTED event from the SoftDevice.
 *
 * @param[in] p_gfp     Nordic UART Service structure.
 * @param[in] p_ble_evt Pointer to the event received from BLE stack.
 */
static void on_connect(ble_gfp_t * p_gfp, ble_evt_t const * p_ble_evt)
{
    ret_code_t                 err_code;
    ble_gfp_evt_t              evt;
    ble_gatts_value_t          gatts_val;
    uint8_t                    cccd_value[2];
    ble_gfp_client_context_t * p_client = NULL;

