guangli2015/google_fast_pair_input_device_nRF5SDK_17_1_0/ble_gfp.c
    err_code = blcm_link_ctx_get(p_gfp->p_link_ctx_storage,
                                 p_ble_evt->evt.gap_evt.conn_handle,
                                 (void *) &p_client);
    if (err_code != NRF_SUCCESS)
    {
        NRF_LOG_ERROR("Link context for 0x%02X connection handle could not be fetched.",
                      p_ble_evt->evt.gap_evt.conn_handle);
    }
 NRF_LOG_INFO("on_connect################################\n");

    /* Check the hosts CCCD value to inform of readiness to send data using the RX characteristic */
    memset(&gatts_val, 0, sizeof(ble_gatts_value_t));
    gatts_val.p_value = cccd_value;
    gatts_val.len     = sizeof(cccd_value);
    gatts_val.offset  = 0;

    err_code = sd_ble_gatts_value_get(p_ble_evt->evt.gap_evt.conn_handle,
                                      p_gfp->keybase_pair_handles.cccd_handle,
                                      &gatts_val);

    if ((err_code == NRF_SUCCESS))
    {
       NRF_LOG_INFO("get keybase_pair_handles################################%d\n",err_code);
    }

        memset(&gatts_val, 0, sizeof(ble_gatts_value_t));
    gatts_val.p_value = cccd_value;
    gatts_val.len     = sizeof(cccd_value);
    gatts_val.offset  = 0;

    err_code = sd_ble_gatts_value_get(p_ble_evt->evt.gap_evt.conn_handle,
                                      p_gfp->addi_data_handles.cccd_handle,
                                      &gatts_val);

    if ((err_code == NRF_SUCCESS))
    {
       NRF_LOG_INFO("get addi_data_handles################################%d\n",err_code);
    }

            memset(&gatts_val, 0, sizeof(ble_gatts_value_t));
    gatts_val.p_value = cccd_value;
    gatts_val.len     = sizeof(cccd_value);
    gatts_val.offset  = 0;

    err_code = sd_ble_gatts_value_get(p_ble_evt->evt.gap_evt.conn_handle,
                                      p_gfp->passkey_handles.cccd_handle,
                                      &gatts_val);

    //if ((err_code == NRF_SUCCESS))
    {
       NRF_LOG_INFO("get passkey_handles################################%d\n",err_code);
    }



}
#endif


/**@brief Function for handling the @ref BLE_GATTS_EVT_WRITE event from the SoftDevice.
 *
 * @param[in] p_gfp     Nordic UART Service structure.
 * @param[in] p_ble_evt Pointer to the event received from BLE stack.
 */
static void on_write(ble_gfp_t * p_gfp, ble_evt_t const * p_ble_evt)
{
    ret_code_t                    err_code;
    ble_gfp_evt_t                 evt;
//    ble_gfp_client_context_t    * p_client;
    ble_gatts_evt_write_t const * p_evt_write = &p_ble_evt->evt.gatts_evt.params.write;
    //size_t accountkey_num = 0;
    //account_key_t accountkeys_array[ACCOUNT_KEYS_COUNT]={0};
    //uint8_t i;

    //err_code = blcm_link_ctx_get(p_gfp->p_link_ctx_storage,
    //                             p_ble_evt->evt.gatts_evt.conn_handle,
    //                             (void *) &p_client);
    //if (err_code != NRF_SUCCESS)
    //{
    //    NRF_LOG_ERROR("Link context for 0x%02X connection handle could not be fetched.",
    //                  p_ble_evt->evt.gatts_evt.conn_handle);
    //}

    //memset(&evt, 0, sizeof(ble_gfp_evt_t));
    //evt.p_gfp       = p_gfp;
    //evt.conn_handle = p_ble_evt->evt.gatts_evt.conn_handle;
    //evt.p_link_ctx  = p_client;
 NRF_LOG_INFO("on_write################################\n");
    if ((p_evt_write->handle == p_gfp->keybase_pair_handles.cccd_handle) &&
        (p_evt_write->len == 2))
    {
        //if (p_client != NULL)
        //{
        //    if (ble_srv_is_notification_enabled(p_evt_write->data))
        //    {
        //        p_client->is_notification_enabled = true;
        //        evt.type                          = BLE_GFP_EVT_COMM_STARTED;
        //    }
        //    else
        //    {
        //        p_client->is_notification_enabled = false;
        //        evt.type                          = BLE_GFP_EVT_COMM_STOPPED;
        //    }

        //    if (p_gfp->data_handler != NULL)
        //    {
        //        p_gfp->data_handler(&evt);
        //    }

        //}
           NRF_LOG_INFO("keybase_pair_ccchandles################################%d&  %d\n",ble_srv_is_notification_enabled(p_evt_write->data),ble_srv_is_indication_enabled(p_evt_write->data));
 
           

    }
    else if ((p_evt_write->handle == p_gfp->passkey_handles.cccd_handle) &&
        (p_evt_write->len == 2))
    {
        //if (p_client != NULL)
        //{
        //    if (ble_srv_is_notification_enabled(p_evt_write->data))
        //    {
        //        p_client->is_notification_enabled = true;
        //        evt.type                          = BLE_GFP_EVT_COMM_STARTED;
        //    }
        //    else
        //    {
        //        p_client->is_notification_enabled = false;
        //        evt.type                          = BLE_GFP_EVT_COMM_STOPPED;
        //    }

        //    if (p_gfp->data_handler != NULL)
        //    {
        //        p_gfp->data_handler(&evt);
        //    }

        //}
         NRF_LOG_INFO("passkey_ccchandles################################\n");
    }
     else if ((p_evt_write->handle == p_gfp->addi_data_handles.cccd_handle) &&
        (p_evt_write->len == 2))
    {
        //if (p_client != NULL)
        //{
        //    if (ble_srv_is_notification_enabled(p_evt_write->data))
        //    {
        //        p_client->is_notification_enabled = true;
        //        evt.type                          = BLE_GFP_EVT_COMM_STARTED;
        //    }
        //    else
        //    {
        //        p_client->is_notification_enabled = false;
        //        evt.type                          = BLE_GFP_EVT_COMM_STOPPED;
        //    }

        //    if (p_gfp->data_handler != NULL)
        //    {
        //        p_gfp->data_handler(&evt);
        //    }

        //}
      NRF_LOG_INFO("addi_data_ccchandles################################%d&  %d\n",ble_srv_is_notification_enabled(p_evt_write->data),ble_srv_is_indication_enabled(p_evt_write->data));
    }
    else if ((p_evt_write->handle == p_gfp->keybase_pair_handles.value_handle) )
    {
        //evt.type                  = BLE_GFP_EVT_RX_DATA;
        //evt.params.rx_data.p_data = p_evt_write->data;
        //evt.params.rx_data.length = p_evt_write->len;

        //p_gfp->data_handler(&evt);
        //uint8_t req_enc[FP_CRYPTO_AES128_BLOCK_LEN];
        //uint8_t public_key[FP_CRYPTO_ECDH_PUBLIC_KEY_LEN];
        uint8_t ecdh_secret[FP_CRYPTO_ECDH_SHARED_KEY_LEN];
        size_t accountkey_num = 0;
        account_key_t accountkeys_array[ACCOUNT_KEYS_COUNT]={0};
        uint8_t i;
        NRF_LOG_INFO("rev len %d\n",p_evt_write->len);
        //for(int i=0;i< p_evt_write->len;i++)
        //{
           //NRF_LOG_INFO(" 0x%x ,",p_evt_write->data[i]);
           
        //}
#if 0
             uint8_t raw_key_buffer[]={

0x36, 0xAC, 0x68, 0x2C, 0x50, 0x82, 0x15, 0x66, 0x8F, 0xBE, 0xFE, 0x24,
0x7D, 0x01, 0xD5, 0xEB, 0x96, 0xE6, 0x31, 0x8E, 0x85, 0x5B, 0x2D, 0x64,
0xB5, 0x19, 0x5D, 0x38, 0xEE, 0x7E, 0x37, 0xBE, 0x18, 0x38, 0xC0, 0xB9,
0x48, 0xC3, 0xF7, 0x55, 0x20, 0xE0, 0x7E, 0x70, 0xF0, 0x72, 0x91, 0x41,
0x9A, 0xCE, 0x2D, 0x28, 0x14, 0x3C, 0x5A, 0xDB, 0x2D, 0xBD, 0x98, 0xEE,
0x3C, 0x8E, 0x4F, 0xBF
    };
      uint8_t m_alice_raw_private_key[] =
{

