guangli2015/google_fast_pair_input_device_nRF5SDK_17_1_0/ble_gfp.c
0x02, 0xB4, 0x37, 0xB0, 0xED, 0xD6, 0xBB, 0xD4, 0x29, 0x06, 0x4A, 0x4E,
0x52, 0x9F, 0xCB, 0xF1, 0xC4, 0x8D, 0x0D, 0x62, 0x49, 0x24, 0xD5, 0x92,
0x27, 0x4B, 0x7E, 0xD8, 0x11, 0x93, 0xD7, 0x63
};
        fp_crypto_ecdh_shared_secret(ecdh_secret,raw_key_buffer,
                                      m_alice_raw_private_key);
#endif


      if(p_evt_write->len > FP_CRYPTO_ECDH_PUBLIC_KEY_LEN )
      {  
// have public key
        err_code = fp_crypto_ecdh_shared_secret(ecdh_secret,(p_evt_write->data)+FP_CRYPTO_AES128_BLOCK_LEN,
                                      anti_spoofing_priv_key);
        if(NRF_SUCCESS != err_code)
        {
          NRF_LOG_ERROR("fp_crypto_ecdh_shared_secret err %x\n",err_code);
        }

         // Alice can now use shared secret
        print_hex(" shared secret: ", ecdh_secret, FP_CRYPTO_ECDH_SHARED_KEY_LEN);

        nrf_crypto_hash_context_t   hash_context;
        //uint8_t  Anti_Spoofing_AES_Key[NRF_CRYPTO_HASH_SIZE_SHA256];
        size_t digest_len = NRF_CRYPTO_HASH_SIZE_SHA256;

           // Initialize the hash context
        err_code = nrf_crypto_hash_init(&hash_context, &g_nrf_crypto_hash_sha256_info);
        if(NRF_SUCCESS != err_code)
        {
          NRF_LOG_ERROR("nrf_crypto_hash_init err %x\n",err_code);
        }

    // Run the update function (this can be run multiples of time if the data is accessible
    // in smaller chunks, e.g. when received on-air.
        err_code = nrf_crypto_hash_update(&hash_context, ecdh_secret, FP_CRYPTO_ECDH_SHARED_KEY_LEN);
        if(NRF_SUCCESS != err_code)
        {
          NRF_LOG_ERROR("nrf_crypto_hash_update err %x\n",err_code);
        }

    // Run the finalize when all data has been fed to the update function.
    // this gives you the result
        err_code = nrf_crypto_hash_finalize(&hash_context, Anti_Spoofing_AES_Key, &digest_len);
        if(NRF_SUCCESS != err_code)
        {
          NRF_LOG_ERROR("nrf_crypto_hash_finalize err %x\n",err_code);
        }
      }
      else
      {

   // no public key
        accountkey_num = nrf_queue_utilization_get(&account_key_queue);
        if(accountkey_num > 0 )
        {
           err_code = nrf_queue_read(&account_key_queue,accountkeys_array,accountkey_num);
           if(NRF_SUCCESS != err_code)
           {
             NRF_LOG_ERROR("nrf_queue_read err %x\n",err_code);
           }

           for (size_t i=0;i<accountkey_num;i++)
            {
                  err_code = nrf_queue_push(&account_key_queue,(accountkeys_array+i));
                  if(NRF_SUCCESS != err_code)
                  {
                      NRF_LOG_ERROR("nrf_queue_push err %x\n",err_code);
                  }
            }
           
        }
        else
        {
           NRF_LOG_ERROR("no account key storage\n");

        }
        
      }
        // NRF_LOG_INFO("keybase_pair_handles################################\n");

        nrf_crypto_aes_info_t const * p_ecb_info;
   
        nrf_crypto_aes_context_t      ecb_decr_ctx;
        p_ecb_info = &g_nrf_crypto_aes_ecb_128_info;
        size_t      len_out;
        uint8_t raw_req[FP_CRYPTO_AES128_BLOCK_LEN];
        err_code = nrf_crypto_aes_init(&ecb_decr_ctx,
                                  p_ecb_info,
                                  NRF_CRYPTO_DECRYPT);
        if(NRF_SUCCESS != err_code)
        {
          NRF_LOG_ERROR("nrf_crypto_aes_init err %x\n",err_code);
        }

        /* Set encryption and decryption key */
    if(p_evt_write->len > FP_CRYPTO_ECDH_PUBLIC_KEY_LEN )
      {  
          err_code = nrf_crypto_aes_key_set(&ecb_decr_ctx, Anti_Spoofing_AES_Key);
          if(NRF_SUCCESS != err_code)
          {
            NRF_LOG_ERROR("nrf_crypto_aes_key_set err %x\n",err_code);
          }

          /* Decrypt blocks */
          len_out = sizeof(raw_req);
          err_code = nrf_crypto_aes_finalize(&ecb_decr_ctx,
                                      (uint8_t *)p_evt_write->data,
                                      FP_CRYPTO_AES128_BLOCK_LEN,
                                      (uint8_t *)raw_req,
                                      &len_out);
          if(NRF_SUCCESS != err_code)
          {
            NRF_LOG_ERROR("nrf_crypto_aes_finalize err %x\n",err_code);
          }
       }
       else
       {// no public key
          for (i=0 ;i < accountkey_num ;i++)
          {
              err_code = nrf_crypto_aes_key_set(&ecb_decr_ctx, accountkeys_array[i].account_key);
              if(NRF_SUCCESS != err_code)
              {
                NRF_LOG_ERROR("nrf_crypto_aes_key_set err %x\n",err_code);
              }

              /* Decrypt blocks */
              len_out = sizeof(raw_req);
              err_code = nrf_crypto_aes_finalize(&ecb_decr_ctx,
                                      (uint8_t *)p_evt_write->data,
                                      FP_CRYPTO_AES128_BLOCK_LEN,
                                      (uint8_t *)raw_req,
                                      &len_out);
              if(NRF_SUCCESS == err_code)
              {
                memcpy(Anti_Spoofing_AES_Key,accountkeys_array[i].account_key,FP_CRYPTO_AES128_BLOCK_LEN);
                 NRF_LOG_INFO("aeskey found from accountkey\n");
              }
          }
       }
//NRF_LOG_ERROR("@@nrf_crypto_aes_finalize err %x\n",err_code);
        struct msg_kbp_write parsed_req;
        parsed_req.msg_type = raw_req[0];
        parsed_req.fp_flags = raw_req[1];
        gfp_memcpy_swap(parsed_req.provider_address, raw_req+2,
			sizeof(parsed_req.provider_address));

        switch (parsed_req.msg_type) {
	case FP_MSG_KEY_BASED_PAIRING_REQ:
		gfp_memcpy_swap(parsed_req.data.kbp_req.seeker_address, raw_req+8,
				sizeof(parsed_req.data.kbp_req.seeker_address)); 

		break;

	case FP_MSG_ACTION_REQ:
		parsed_req.data.action_req.msg_group = raw_req[8];
		parsed_req.data.action_req.msg_code = raw_req[9];
		parsed_req.data.action_req.additional_data_len_or_id = raw_req[10];

		memcpy(parsed_req.data.action_req.additional_data, raw_req+11,
		       sizeof(parsed_req.data.action_req.additional_data));

		break;

	default:
		NRF_LOG_ERROR("Unexpected message type: 0x%x (Key-based Pairing)",
			parsed_req.msg_type);
		
